    import React from "react";
import ClassComponent from "./ClassComponent";
function Lviv_milyavskiy() {
    return(
<div>

<h1>Історія Львова</h1>

<p><b>Львів</b>- <small>найбільше місто західгої України, що протягом багатовікової іторії було, і є нині, науковим, культурним та національним центром регіону.</small></p>
<p><i><b>В найдавніші часи</b></i>- столиця Галицько-Волинської держави, згодом - адміністративний центр Руського воєводства, автономного Королівства Галіції і Лодомерії.</p>
<p>У<s>1920</s> 1918 році- столиця ЗУНР.Після захоплення міста Польщею ЛЬвів став центром однойменного воєводства.</p>
<p>У Другій світовій війні був окупований спочатку радянською, а потім німецькою арміями.</p>
У повоєнний період відійшов до Радянського Союзу. <ins> З 1991 року -адміністративний центр Львівської області Незалежної України. </ins>
<h3><b>Зміст</b></h3>
<ol>
<li><b>Заснування</b></li>
<li><b>1253-<ClassComponent count={1349}/>:</b>Руське Королівство(Галицько-Волинська держава):протистояння з Золотою Ордою</li>
<li><b>1349-<ClassComponent count={1387}/>:</b>Руське Королівство: протистояння з Польщею та Угорщиною</li>
<li><b>1387-<ClassComponent count={1772}/>:</b>під владою Польського королівства та Речі Посполитої</li>
<li><b>1772-<ClassComponent count={1914}/>:</b>у складі Австрійської(згодом Австро-Угорської) імперії</li>
<li><b>1914-<ClassComponent count={1919}/>:</b>у період Першої світової війни та Української революції</li>
<li><b>1919-<ClassComponent count={1939}/>:</b>у складі Другої Речі Посполитої</li>
<li><b>1939-<ClassComponent count={1944}/>:</b>у період Другої світової війни</li>
</ol>
</div>
    )
}
export default Lviv_milyavskiy
